URLShortener/app/models/shortened_url.rb

  def self.random_code
    while true
      shorty_url = SecureRandom.urlsafe_base64
      return shorty_url unless ShortenedUrl.exists?(short_url: shorty_url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "cYisF66NgrbNN_Zw554gGg"], ["LIMIT", 1]]

  def self.make(user, longy_url) #<-- ask about this
    shorty_url = ShortenedUrl.random_code

    ShortenedUrl.create!(short_url: shorty_url, long_url: longy_url, user_id: user.id)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "ggggggggggggggggggggggggggggggg"], ["short_url", "741q20LL0jQEFd01WEXWWA"], ["user_id", 3], ["created_at", "2019-03-27 22:41:04.075877"], ["updated_at", "2019-03-27 22:41:04.075877"]]