URLShortener/app/models/visit.rb

INSERT INTO "visits" ("user_id", "url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["url_id", 7], ["created_at", "2019-03-27 23:20:30.864864"], ["updated_at", "2019-03-27 23:20:30.864864"]]
---
  def self.record_visit!(user, shortened_url)
    Visit.create!(user_id: user.id, url_id: shortened_url.id)